apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Classes/AppleUSBUHCI_UIM.cpp
					case kUSBInterrupt:
						pPrevQHLive = _intrQH[pQH->interruptSlot];
						pQH->_logicalNext = pPrevQHLive->_logicalNext;
						pQH->SetPhysicalLink(pPrevQHLive->GetPhysicalLink());
						IOSync();
						
						pPrevQHLive->_logicalNext = pQH;
						pPrevQHLive->SetPhysicalLink(pQH->GetPhysicalAddrWithType());
					break;
						
					default:
						USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- found QH[%p] with unknown type(%d)", this, pQH, pQH->type);
						break;
				}
				// advance the pointer
				if (pPrevQH)
					pQH = OSDynamicCast(AppleUHCIQueueHead, pPrevQH->_logicalNext);
				else
					pQH = _disabledQHList;
			}
			else
			{
				// advance the pointer when we didn't find what we were looking for
				pPrevQH = pQH;
				pQH = OSDynamicCast(AppleUHCIQueueHead, pQH->_logicalNext);
			}
		}
		return kIOReturnSuccess;
	}
	
	// the disable case
	USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- looking for endpoints for device address(%d) to disable", this, address);
	
	for (slot=0; slot < kUHCI_NVFRAMES; slot++)
	{
		IOUSBControllerListElement				*pLE;
		IOUSBControllerListElement				*pPrevLE = NULL;

		pLE = _logicalFrameList[slot];
		while (pLE)
		{
			// need to determine which kind of list element this is
			AppleUHCIIsochTransferDescriptor	*pITD = OSDynamicCast(AppleUHCIIsochTransferDescriptor, pLE);
			AppleUHCIQueueHead					*pQH =	OSDynamicCast(AppleUHCIQueueHead, pLE);
			
			if (pQH && (pQH->type != kQHTypeDummy) && (pQH->functionNumber == address))
			{
				AppleUHCIQueueHead				*pPrevQH =	OSDynamicCast(AppleUHCIQueueHead, pPrevLE);
				USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- found pQH[%p] which matches (pPrevQH[%p])", this, pQH, pPrevQH);
				if (!pPrevQH)
				{
					USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- unexpected NULL pPrevQH", this);
				}
				else
				{
					err = UnlinkQueueHead(pQH, pPrevQH);
					if (err)
					{
						USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- err[%p] unlinking queue head", this, (void*)err);
					}
					else
					{
						// well now that it is off the queue, what do i do with it?
						pLE = pPrevLE;							// reset for the counter to the previous QH
						
						// now link the pQH into the disabled list
						pQH->_logicalNext = _disabledQHList;
						_disabledQHList = pQH;
					}
				}
			}
			
			// I need to be aware of where the current frame is when processing the Isoch List
			if (pITD && (UHCI_TD_GET_ADDR(USBToHostLong(pITD->GetSharedLogical()->token))))
			{
				USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAddressEndpoints- found pITD[%p] which matches", this, pITD);
			}
			pPrevLE = pLE;
			pLE = pLE->_logicalNext;
		}
	}
	return kIOReturnSuccess;
}



IOReturn
AppleUSBUHCI::UIMEnableAllEndpoints(bool enable)
{
	UInt32							slot;
	IOReturn						err;
	
	USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints(%s)", this, enable ? "true" : "false");
	if (enable)
	{
		AppleUHCIQueueHead					*pQH = _disabledQHList;
		AppleUHCIQueueHead					*pPrevQH = NULL;
		AppleUHCIQueueHead					*pPrevQHLive = NULL;
		
		USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- looking for QHs in the disabled queue", this);
		while (pQH)
		{
			USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- found QH[%p] which matches", this, pQH);
			// first adjust the list
			_disabledQHList = OSDynamicCast(AppleUHCIQueueHead, pQH->_logicalNext);
			pQH->_logicalNext = NULL;
			// now stick pQH back in the queue
			switch (pQH->type)
			{
				case kUSBControl:
					// Now link the endpoint's queue head into the schedule
					if (pQH->speed == kUSBDeviceSpeedLow) 
					{
						pPrevQHLive = _lsControlQHEnd;
					} else 
					{
						pPrevQHLive = _fsControlQHEnd;
					}
					
					pQH->_logicalNext = pPrevQHLive->_logicalNext;
					pQH->SetPhysicalLink(pPrevQHLive->GetPhysicalLink());
					IOSync();
					
					pPrevQHLive->_logicalNext = pQH;
					pPrevQHLive->SetPhysicalLink(pQH->GetPhysicalAddrWithType());
					IOSync();
					if (pQH->speed == kUSBDeviceSpeedLow) 
					{
						_lsControlQHEnd = pQH;
					} else 
					{
						_fsControlQHEnd = pQH;
					}
					break;
					
				case kUSBBulk:
					pPrevQHLive = _bulkQHEnd;
					pQH->_logicalNext = pPrevQHLive->_logicalNext;
					pQH->SetPhysicalLink(pPrevQHLive->GetPhysicalLink());
					IOSync();
					
					pPrevQHLive->_logicalNext = pQH;
					pPrevQHLive->SetPhysicalLink(pQH->GetPhysicalAddrWithType());
					IOSync();
					_bulkQHEnd = pQH;
				break;
					
				case kUSBInterrupt:
					pPrevQHLive = _intrQH[pQH->interruptSlot];
					pQH->_logicalNext = pPrevQHLive->_logicalNext;
					pQH->SetPhysicalLink(pPrevQHLive->GetPhysicalLink());
					IOSync();
					
					pPrevQHLive->_logicalNext = pQH;
					pPrevQHLive->SetPhysicalLink(pQH->GetPhysicalAddrWithType());
				break;
					
				default:
					USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- found QH[%p] with unknown type(%d)", this, pQH, pQH->type);
					break;
			}
			// advance the pointer
			pQH = _disabledQHList;
		}
		return kIOReturnSuccess;
	}
	
	// the disable case
	USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- looking for endpoints for to disable", this);
	
	for (slot=0; slot < kUHCI_NVFRAMES; slot++)
	{
		IOUSBControllerListElement				*pLE;
		IOUSBControllerListElement				*pPrevLE = NULL;

		pLE = _logicalFrameList[slot];
		while (pLE)
		{
			// need to determine which kind of list element this is
			AppleUHCIIsochTransferDescriptor	*pITD = OSDynamicCast(AppleUHCIIsochTransferDescriptor, pLE);
			AppleUHCIQueueHead					*pQH =	OSDynamicCast(AppleUHCIQueueHead, pLE);
			
			if (pQH && (pQH->type != kQHTypeDummy))
			{
				AppleUHCIQueueHead				*pPrevQH =	OSDynamicCast(AppleUHCIQueueHead, pPrevLE);
				USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- found pQH[%p] which matches (pPrevQH[%p])", this, pQH, pPrevQH);
				if (!pPrevQH)
				{
					USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- unexpected NULL pPrevQH", this);
				}
				else
				{
					err = UnlinkQueueHead(pQH, pPrevQH);
					if (err)
					{
						USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- err[%p] unlinking queue head", this, (void*)err);
					}
					else
					{
						// well now that it is off the queue, what do i do with it?
						pLE = pPrevLE;							// reset for the counter to the previous QH
						
						// now link the pQH into the disabled list
						pQH->_logicalNext = _disabledQHList;
						_disabledQHList = pQH;
					}
				}
			}
			
			// I need to be aware of where the current frame is when processing the Isoch List
			if (pITD && (UHCI_TD_GET_ADDR(USBToHostLong(pITD->GetSharedLogical()->token))))
			{
				USBLog(2, "AppleUSBUHCI[%p]::UIMEnableAllEndpoints- found pITD[%p] which matches", this, pITD);
			}
			pPrevLE = pLE;
			pLE = pLE->_logicalNext;
		}
	}
	return kIOReturnSuccess;
}
